---
kind: method
id: M:Autodesk.Revit.DB.DefinitionBindingMap.GetEnumerator
source: html/d1b49bd8-0f3e-26c6-5fcb-ea063222c430.htm
---
# Autodesk.Revit.DB.DefinitionBindingMap.GetEnumerator Method

Retrieve a forward moving iterator to the map.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the map.